In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [3]:
df['col2'].unique()

array([444, 555, 666])

In [4]:
df['col2'].nunique()

3

In [5]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [6]:
 df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [7]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [8]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [9]:
def times2(x):
    return x*2

In [10]:
df['col1']

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [11]:
df['col1'] = df['col1'].apply(times2)

In [12]:
df

   col1  col2 col3
0     2   444  abc
1     4   555  def
2     6   666  ghi
3     8   444  xyz

In [13]:
df['col1'] = df['col1'].apply(lambda x: x/2)

In [14]:
df

   col1  col2 col3
0   1.0   444  abc
1   2.0   555  def
2   3.0   666  ghi
3   4.0   444  xyz

In [15]:
df['col1'].sum()

10.0

In [17]:
df['col3']

0    abc
1    def
2    ghi
3    xyz
Name: col3, dtype: object

In [19]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [20]:
df.drop('col1', axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [21]:
df

   col1  col2 col3
0   1.0   444  abc
1   2.0   555  def
2   3.0   666  ghi
3   4.0   444  xyz

In [22]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [23]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [24]:
df

   col1  col2 col3
0   1.0   444  abc
1   2.0   555  def
2   3.0   666  ghi
3   4.0   444  xyz

In [9]:
df.sort_values(by="col2")

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [48]:
df[['col1', 'col2', 'col3']] == [1, 555, 'xyz']

    col1   col2   col3
0   True  False  False
1  False   True  False
2  False  False  False
3  False  False   True

In [22]:
df.isnull()[df.isnull()[['col1', 'col2', 'col3']] == True]

  col1 col2 col3
0  NaN  NaN  NaN
1  NaN  NaN  NaN
2  NaN  NaN  NaN
3  NaN  NaN  NaN

In [23]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [24]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [51]:
df.pivot_table(
    values='D',
    index=['A', 'B'],
    columns=['C']
)

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN